app/controllers/api/v1/accounts_controller.rb

SELECT  "accounts".* FROM "accounts" ORDER BY "accounts"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
      def show
        render json: Account.last