app/controllers/api/v1/products_controller.rb

      def create
        @product = @shop.products.build(product_params)

        if @product.save
---
INSERT INTO "products" ("shop_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["shop_id", 1], ["name", "sex toy"], ["created_at", "2018-08-25 15:24:30.367191"], ["updated_at", "2018-08-25 15:24:30.367191"]]

      def set_shop
        @shop ||= @account.shops.find(params[:shop_id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."account_id" = $1 AND "shops"."id" = $2 LIMIT $3  [["account_id", 1], ["id", 1], ["LIMIT", 1]]

      def set_product
        @product ||= @shop.products.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."shop_id" = $1 AND "products"."id" = $2 LIMIT $3  [["shop_id", 1], ["id", 6], ["LIMIT", 1]]