app/controllers/api/v1/products_controller.rb

      def show
        render json: shop.products.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."shop_id" = $1 AND "products"."id" = $2 LIMIT $3  [["shop_id", 1], ["id", 6], ["LIMIT", 1]]

      def account
        @account ||= Account.find(params[:account_id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]