app/controllers/api/v1/shops_controller.rb

    def show
      render json: account.shops.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."account_id" = $1 AND "shops"."id" = $2 LIMIT $3  [["account_id", 1], ["id", 1], ["LIMIT", 1]]