app/controllers/api/v1/shops_controller.rb

INSERT INTO "shops" ("account_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["account_id", 1], ["name", "Ashan"], ["created_at", "2018-08-25 13:33:41.484695"], ["updated_at", "2018-08-25 13:33:41.484695"]]
---
      def create
        @shop = @account.shops.build(shop_params)

        if @shop.save

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def set_account
        @account ||= Account.find(params[:account_id])

SELECT  "shops".* FROM "shops" WHERE "shops"."account_id" = $1 AND "shops"."id" = $2 LIMIT $3  [["account_id", 1], ["id", 1], ["LIMIT", 1]]
---
      def set_shop
        @shop ||= @account.shops.find(params[:id])